package dmitry178.example.qaapp;

public class Questions4 {
    private String mQuestions4[] = {
            "1. Назва цієї нелітаючої птиці з Австралії складається з двох нот. Що це за птах?",
            "2. Назвіть найвідоміший балет П.І.Чайковського, присвячений птахам.",
            "3. Цього звіра, який любить поспати, Людвіг ван Бетховен оспівав у своїй пісні.",
            "4. З якого вічнозеленого дерева роблять піаніно і скрипки?",
            "5. Цей музичний інструмент дуже схожий на величезне крило метелика.",
            "6. Цих тварин скрипалі тримали в футлярах, щоб не потіли руки.",
            "7. Яка богиня в Стародавній Греції протегувала музичному мистецтву?",
            "8. З латинської мови назва цього інструменту перекладається як «подих».",
            "9. Де вперше з'явився акордеон?",
            "10. Ф. Ліст називав цей музичний інструмент «королем усіх інструментів»."
    };
    //////////////////////////////
    private String mChoices4[][] = {
            {"Додо*", "Бекас", "Беркут", "Ворон"},
            {"Лебедине озеро*", "The Sleeping Beauty", "Лускунчик", "Спляча красуня"},
            {"Бабак*", "Квокки", "Бородатий тамарин", "Фенек"},
            {"Ялина*", "Іва", "Дуб", "Береза"},
            {"Арфа*", "Гуслі", "Балалайка", "Домра"},
            {"Жаби*", "Ящірки", "Папуги", "Щури"},
            {"Евтерпа*", "Аглая", "Ананке", "Астерія"},
            {"Флейта*", "Сопілка", "Зурна", "Альбока"},
            {"У Празі*", "У Римі", "У Києві", "У Варшаві"},
            {"Рояль*", "Труба", "Кларнет", "Баян"}
    };
    //////////////////////////////
    private String mCorrectAnswers4[] = {"Додо*", "Лебедине озеро*", "Бабак*", "Ялина*", "Арфа*",
            "Жаби*", "Евтерпа*", "Флейта*", "У Празі*", "Рояль*"};
    //////////////////////////////
    public int getLength4() { return mQuestions4.length; }
    //////////////////////////////
    public String getQuestion4(int a) {
        String question4 = mQuestions4[a];
        return question4;
    }
    //////////////////////////////
    public String getChoice4(int index, int num) {
        String choice4 = mChoices4[index][num-1];
        return choice4;
    }
    //////////////////////////////
    public String getCorrectAnswer4(int a) {
        String answer4 = mCorrectAnswers4[a];
        return answer4;
    }
}