package dmitry178.example.qaapp;

public class Questions {

    private String mQuestions[] = {
            "1. Ім'я чинного імператора Японії (за даними 17.01.2021)?",
            "2. Рік скасування кріпосного права?",
            "3. Скільки республік входило до складу СРСР на момент 30 грудня 1922 року?",
            "4. Який Британський монарх з нижчеперелічених перебував при владі найтриваліший термін (за даними на 17.01.2021)?",
            "5. Дата початку Першої світової війни?",
            "6. Під чиїм ім'ям почалася перша навколосвітня подорож?",
            "7. Скільки тривала Столітня війна?",
            "8. Друга найбільша за розмірами імперія за всю історію людства?",
            "9. Яка перша республіка вийшла зі складу СРСР?",
            "10. Коли був запущений перший у світі веб-сайт?"
    };
    //////////////////////////////
    private String mChoices[][] = {
            {"Акіхіто", "Нарухіто*", "Хірохіто", "Йосіхіто"},
            {"1861*", "1873", "1888", "1860"},
            {"1", "2", "3", "4*"},
            {"Єлизавета I", "Едуард III Вінчестер", "Єлизавета II*", "Георг V"},
            {"1 квітня 1911", "3 березня 1918", "11 лютого 1912", "28 липня 1914*"},
            {"Фернан Магеллан*", "Хуан Себастьян Елькано", "Христофор Колумб", "Амеріго Веспуччі"},
            {"100 років", "116 років*", "110 років", "112 років"},
            {"Російська імперія", "Римська імперія", "Монгольська імперія*", "Імперія Цин"},
            {"Естонська РСР*", "Українська РСР", "Латвійська РСР", "Азербайджанська РСР"},
            {"7 вересня 1991", "6 серпня 1991*", "8 серпня 1991", "19 серпня 1992"}
    };
    //////////////////////////////
    private String mCorrectAnswers[] = {"Нарухіто*", "1861*", "4*", "Єлизавета II*", "28 липня 1914*",
            "Фернан Магеллан*", "116 років*", "Монгольська імперія*", "Естонська РСР*", "6 серпня 1991*"};
    //////////////////////////////
    public int getLength() { return mQuestions.length; }
    //////////////////////////////
    public String getQuestion(int a) {
        String question = mQuestions[a];
        return question;
    }
    //////////////////////////////
    public String getChoice(int index, int num) {
        String choice = mChoices[index][num-1];
        return choice;
    }
    //////////////////////////////
    public String getCorrectAnswer(int a) {
        String answer = mCorrectAnswers[a];
        return answer;
    }
}
