package dmitry178.example.qaapp;

public class Questions2 {

    private String mQuestions2[] = {
            "1. Найменша в світі держава?",
            "2. Скільки всього існує континентів?",
            "3. Назва якої країни збігається з ім'ям її столиці?",
            "4. Сама південна точка СРСР?",
            "5. Назва річки, що випливає з Байкалу?",
            "6. Скільки штатів має США?",
            "7. Найбільша повноводна ріка в світі?",
            "8. Столиця США?",
            "9. Найбільша країна в світі?",
            "10. Скільки в світі країн з монархічною формою правління?"
    };
    //////////////////////////////
    private String mChoices2[][] = {
            {"Монако", "Сан-Марино", "Ватикан*", "Кіпр"},
            {"4", "5", "6", "7*"},
            {"Джібуті*", "Нікарагуа", "Парагвай", "Гвінея-Бісау"},
            {"гора Рагдай", "місто Кушка*", "острів Ратманова", "місто Дербент"},
            {"Об", "Ангара*", "Єнісей", "Амур"},
            {"52", "51", "50*", "49"},
            {"Амазонка*", "Ніл", "Ганг", "Волга"},
            {"Нью-Йорк", "Вашингтон*", "Лос-Анджелес", "Каліфорнія"},
            {"Канада", "Україна", "США", "Росія*"},
            {"11", "18", "24", "30*"}
    };
    //////////////////////////////
    private String mCorrectAnswers2[] = {"Ватикан*", "7*", "Джібуті*", "місто Кушка*", "Ангара*",
            "50*", "Амазонка*", "Вашингтон*", "Росія*", "30*"};
    //////////////////////////////
    public int getLength2() { return mQuestions2.length; }
    //////////////////////////////
    public String getQuestion2(int a) {
        String question2 = mQuestions2[a];
        return question2;
    }
    //////////////////////////////
    public String getChoice2(int index, int num) {
        String choice2 = mChoices2[index][num-1];
        return choice2;
    }
    //////////////////////////////
    public String getCorrectAnswer2(int a) {
        String answer2 = mCorrectAnswers2[a];
        return answer2;
    }
}
