package dmitry178.example.qaapp;

public class Questions3 {
    private String mQuestions3[] = {
            "1. Ця планета могла стати зіркою, але не мала достатньо маси.",
            "2. Яким за рахунком розташований від Сонця Меркурій?",
            "3. Скільки супутників у Марса?",
            "4. Найбільший супутник в Сонячній системі?",
            "5. Найбільша планета Сонячної системи?",
            "6. До якого класу належить Сонце?",
            "7. Скільки всього планет в Сонячній системі?",
            "8. Яка з перерахованих планет має на своїй орбіті кільця?",
            "9. Найхолодніша планета Сонячної системи?",
            "10. Єдина планета названа не в честь бога?"
    };
    //////////////////////////////
    private String mChoices3[][] = {
            {"Сатурн*", "Юпітер", "Венера", "Марс"},
            {"1*", "2", "3", "4"},
            {"1", "2", "3*", "4"},
            {"Місяць", "Іо", "Європа", "Ганімед*"},
            {"Уран", "Нептун", "Юпітер*", "Сатурн"},
            {"Жовтий карлик*", "Білий карлик", "Червоний гігант", "Пульсар"},
            {"5", "6*", "7", "8"},
            {"Венера", "Сатурн*", "Земля", "Меркурій"},
            {"Уран*", "Нептун", "Плутон", "Венера"},
            {"Уран", "Венера", "Земля*", "Меркурій"}
    };
    //////////////////////////////
    private String mCorrectAnswers3[] = {"Сатурн*", "1*", "3*", "Ганімед*", "Юпітер*", "Жовтий карлик*",
            "6*", "Сатурн*", "Уран*", "Земля*"};
    //////////////////////////////
    public int getLength3() { return mQuestions3.length; }
    //////////////////////////////
    public String getQuestion3(int a) {
        String question3 = mQuestions3[a];
        return question3;
    }
    //////////////////////////////
    public String getChoice3(int index, int num) {
        String choice3 = mChoices3[index][num-1];
        return choice3;
    }
    //////////////////////////////
    public String getCorrectAnswer3(int a) {
        String answer3 = mCorrectAnswers3[a];
        return answer3;
    }
}
